import styles from "../Info.module.scss";

export default function Agreement() {
  return (
    <div className={styles.page}>
      <div className={styles.wrapper}>
        <h2 className={styles.title}>Пользовательское соглашение</h2>

        <div className={styles.content}>
          <section className={styles.section}>
            <h3>1. ОБЩИЕ ПОЛОЖЕНИЯ</h3>
            <p>
              1.1 Настоящее Пользовательское соглашение (далее – Соглашение)
              относится к сайту «
              <a
                href="https://gamestate-monitor.ru"
                target="_blank"
                rel="noopener noreferrer"
              >
                gamestate-monitor.ru
              </a>
              », расположенному по адресу «
              <a
                href="https://gamestate-monitor.ru"
                target="_blank"
                rel="noopener noreferrer"
              >
                https://gamestate-monitor.ru
              </a>
              ».
            </p>
            <p>
              1.2. Сайт «gamestate-monitor.ru» (далее – Сайт) является
              собственностью ______.
            </p>
            <p>
              1.3. Настоящее Соглашение регулирует отношения между Пользователем
              (далее – &quot;Вы&quot; или &quot;Пользователь&quot;) и
              Администрацией сайта «gamestate-monitor.ru» (далее –
              &quot;Мы&quot; или &quot;Администрация сайта&quot;).
            </p>
            <p>
              1.4. Мы оставляем за собой право в любое время изменять, добавлять
              или удалять пункты настоящего Соглашения без предварительного
              уведомления Пользователя.
            </p>
            <p>
              1.5. Использование Сайта Пользователем означает Ваше принятие
              Соглашения и всех внесенных в него изменений.
            </p>
            <p>
              1.6. Вы несете персональную ответственность за ознакомление с
              настоящим Соглашением и проверку наличия в нем изменений.
            </p>
            <p>
              1.7. Сайт может содержать ссылки на другие ресурсы в сети
              Интернет.
            </p>
            <p>
              Пользователь признает и соглашается с тем, что Сайт не несет
              никакой ответственности за доступность или недоступность этих
              ресурсов, за их содержание и за их контент, а также за любые
              последствия, связанные с использованием этих ресурсов и/или их
              контента.
            </p>
            <p>
              Если Пользователь решил покинуть Сайт и перейти к сайтам, иным
              ресурсам третьих лиц или использовать, или установить программы
              третьих лиц, он делает это на свой страх и риск и под свою полную
              ответственность и с этого момента настоящее Соглашение более не
              распространяется на Пользователя.
            </p>
          </section>

          <section className={styles.section}>
            <h3>2. ОПРЕДЕЛЕНИЯ ТЕРМИНОВ</h3>
            <p>
              2.1. Перечисленные ниже термины имеют для целей настоящего
              Соглашения следующее значение:
            </p>
            <p>
              2.1.1 «
              <a
                href="https://gamestate-monitor.ru"
                target="_blank"
                rel="noopener noreferrer"
              >
                gamestate-monitor.ru
              </a>
              » – Интернет-ресурс, расположенный на доменном имени «
              <a
                href="https://gamestate-monitor.ru"
                target="_blank"
                rel="noopener noreferrer"
              >
                https://gamestate-monitor.ru
              </a>
              », осуществляющий свою деятельность посредством Интернет-ресурса и
              сопутствующих ему сервисов (далее - Сайт).
            </p>
            <p>
              2.1.2. «gamestate-monitor.ru» – сайт, содержащий информацию о
              Товарах и/или Услугах и/или Иных ценностях для пользователя,
              Продавце и/или Исполнителе услуг, позволяющий осуществить выбор,
              заказ и (или) приобретение Товара, и/или получение услуги.
            </p>
            <p>
              2.1.3. Администрация сайта – уполномоченное лицо, ответственное за
              управление и обеспечение работы Сайта, контроль соблюдения
              Пользовательского соглашения, а также предоставление поддержки
              Пользователям в случае необходимости, действующее от имени лица
              ________.
            </p>
            <p>
              2.1.4. Пользователь сайта (далее - Пользователь) – дееспособное
              лицо, имеющее доступ к Сайту посредством сети Интернет и
              использующее Сайт.
            </p>
            <p>
              2.1.5. Содержание сайта (далее – Содержание) - охраняемые
              результаты интеллектуальной деятельности, включая тексты
              литературных произведений, их названия, предисловия, аннотации,
              статьи, иллюстрации, обложки, музыкальные произведения с текстом
              или без текста, графические, текстовые, фотографические,
              производные, составные и иные произведения, пользовательские
              интерфейсы, визуальные интерфейсы, названия товарных знаков,
              логотипы, программы для ЭВМ, базы данных, а также дизайн,
              структура, выбор, координация, внешний вид, общий стиль и
              расположение данного Содержания, входящего в состав Сайта и другие
              объекты интеллектуальной собственности, все вместе и/или по
              отдельности, содержащиеся на Сайте{" "}
              <a
                href="https://gamestate-monitor.ru"
                target="_blank"
                rel="noopener noreferrer"
              >
                gamestate-monitor.ru
              </a>
              .
            </p>
            <p>
              2.1.6. Игровой сервер (далее - Сервер) - программно-аппаратный
              комплекс, обеспечивающий работу многопользовательской сетевой игры
              через интернет, находящийся под управлением третьими лицами.
            </p>
            <p>
              2.1.7. Мониторинг игровых серверов (далее - Мониторинг) -
              совокупность программ для ЭВМ и баз данных Администрации сайта,
              представленная по адресу{" "}
              <a
                href="https://gamestate-monitor.ru"
                target="_blank"
                rel="noopener noreferrer"
              >
                gamestate-monitor.ru
              </a>{" "}
              в виде электронного каталога (списка) общедоступных Серверов,
              которые Пользователи добавляют в Мониторинг, позволяющая
              Пользователям просматривать общий список Серверов третьих лиц, их
              публичные характеристики, а также иную информацию, предоставляемую
              серверами в открытом доступе посредством стандартизированного
              протокола запросов (Server Query Protocol).
            </p>
          </section>

          <section className={styles.section}>
            <h3>3. ПРЕДМЕТ СОГЛАШЕНИЯ</h3>
            <p>
              3.1. Предметом настоящего Соглашения является предоставление
              Пользователю доступа к содержащимся на Сайте товарам и/или
              оказываемым услугам.
            </p>
            <p>
              3.1.1. Сайт предоставляет Пользователю следующие виды услуг
              (сервисов):
            </p>
            <p className={styles.subsection_list}>
              3.1.1.1. Предоставление Пользователю возможности размещения
              сообщений, комментариев, рецензий Пользователей, выставления
              оценок контенту сайта;
            </p>
            <p className={styles.subsection_list}>
              3.1.1.2. Ознакомление с товарами/услугами, размещенными на Сайте;
            </p>
            <p className={styles.subsection_list}>
              3.1.1.3. Выбор и заказ товаров/услуг для осуществления последующей
              покупки или оформления на данном Сайте.
            </p>
            <p>
              3.1.2. Под действие настоящего Соглашения подпадают все
              существующие и функционирующие на данный момент услуги (сервисов)
              Сайта, а также любые их последующие модификации и появляющиеся в
              дальнейшем дополнительные услуги (сервисы).
            </p>
            <p>3.2. Доступ к сайту предоставляется на бесплатной основе.</p>
            <p>
              3.3. Настоящее Соглашение является публичной офертой. Получая
              доступ к Сайту, Пользователь считается присоединившимся к
              настоящему Соглашению.
            </p>
            <p>
              3.4. Использование материалов и сервисов Сайта регулируется
              нормами действующего законодательства Российской Федерации.
            </p>
            <p>
              3.5. Ссылка на любой сайт, ресурс, продукт, услугу, товары, любую
              иную информацию, размещенная на Сайте, не является и никогда не
              будет являться одобрением или рекомендацией данных сайтов,
              ресурсов, продуктов, товаров, услуг со стороны Сайта или
              Администрации.
            </p>
          </section>

          <section className={styles.section}>
            <h3>4. ПРАВА И ОБЯЗАННОСТИ СТОРОН</h3>
            <h4>4.1. Администрация сайта вправе:</h4>
            <p className={styles.list_item}>
              4.1.1. Изменять правила пользования Сайтом, а также изменять
              содержание данного Сайта.
            </p>
            <p className={styles.list_item}>
              Изменения вступают в силу с момента публикации новой редакции
              Соглашения на Сайте.
            </p>
            <p className={styles.list_item}>
              4.1.2. При необходимости запросить у Пользователя дополнительную
              информацию, которая имеет непосредственное отношение к
              предоставляемым услугам.
            </p>
            <p className={styles.list_item}>
              4.1.3. Ограничить доступ к Сайту Пользователю в случае нарушения
              последним настоящего Соглашения или норм законодательства
              Российской Федерации.
            </p>
            <h4>4.2. Пользователь вправе:</h4>
            <p className={styles.list_item}>
              4.2.1. Пользоваться всеми имеющимися на Сайте услугами, а также
              приобретать любые товары и/или услуги, предлагаемые на Сайте.
            </p>
            <p className={styles.list_item}>
              4.2.2. Задавать любые вопросы, относящиеся к услугам сайта:
            </p>
            <p className={styles.subsection_list}>
              4.2.2.1. через Форму обратной связи, расположенную по адресу:
              <a
                href="https://gamestate-monitor.ru/contacts"
                target="_blank"
                rel="noopener noreferrer"
              >
                https://gamestate-monitor.ru/contacts
              </a>
            </p>
            <p className={styles.subsection_list}>
              4.2.2.2. по электронной почте:{" "}
              <a href="mailto:administration@gamestate-monitor.ru">
                administration@gamestate-monitor.ru
              </a>
            </p>
            <p className={styles.list_item}>
              4.2.3. Пользоваться Сайтом исключительно в целях и порядке,
              предусмотренных Соглашением и не запрещенных законодательством
              Российской Федерации.
            </p>
            <h4>4.3. Пользователь обязуется:</h4>
            <p className={styles.list_item}>
              4.3.1. Предоставлять по запросу Администрации сайта дополнительную
              информацию, которая имеет непосредственное отношение к
              предоставляемым услугам данного Сайта.
            </p>
            <p className={styles.list_item}>
              4.3.2. Соблюдать имущественные и неимущественные права авторов и
              иных правообладателей при использовании Сайта.
            </p>
            <p className={styles.list_item}>
              4.3.3. Не предпринимать действий, которые могут рассматриваться
              как нарушающие нормальную работу Сайта.
            </p>
            <p className={styles.list_item}>
              4.3.4. Не распространять с использованием Сайта любую
              конфиденциальную и охраняемую законодательством Российской
              Федерации информацию о физических либо юридических лицах.
            </p>
            <p className={styles.list_item}>
              4.3.5. Избегать любых действий, в результате которых может быть
              нарушена конфиденциальность охраняемой законодательством
              Российской Федерации информации.
            </p>
            <p className={styles.list_item}>
              4.3.6. Не использовать Сайт для распространения информации
              рекламного характера, иначе как с согласия Администрации сайта.
            </p>
            <p className={styles.list_item}>
              4.3.7. Не использовать сервисы с целью:
            </p>
            <p className={styles.subsection_list}>
              4.3.7.1. нарушения прав несовершеннолетних лиц и (или) причинение
              им вреда в любой форме.
            </p>
            <p className={styles.subsection_list}>
              4.3.7.2. ущемления прав меньшинств.
            </p>
            <p className={styles.subsection_list}>
              4.3.7.3. представления себя за другого человека или представителя
              организации и (или) сообщества без достаточных на то прав, в том
              числе за сотрудников данного сайта.
            </p>
            <p className={styles.subsection_list}>
              4.3.7.4. введения в заблуждение относительно свойств и
              характеристик какого-либо Товара и/или услуги, размещенных на
              Сайте.
            </p>
            <p className={styles.subsection_list}>
              4.3.7.5. некорректного сравнения Товара и/или Услуги, а также
              формирования негативного отношения к лицам, (не) пользующимся
              определенными Товарами и/или услугами, или осуждения таких лиц.
            </p>
            <p className={styles.subsection_list}>
              4.3.7.6. загрузки контента, который является незаконным, нарушает
              любые права третьих лиц; пропагандирует насилие, жестокость,
              ненависть и (или) дискриминацию по расовому, национальному,
              половому, религиозному, социальному признакам; содержит
              недостоверные сведения и (или) оскорбления в адрес конкретных лиц,
              организаций, органов власти.
            </p>
            <p className={styles.subsection_list}>
              4.3.7.7. побуждения к совершению противоправных действий, а также
              содействия лицам, действия которых направлены на нарушение
              ограничений и запретов, действующих на территории Российской
              Федерации.
            </p>
            <p className={styles.list_item}>
              4.3.8. Обеспечить достоверность предоставляемой информации.
            </p>
            <p className={styles.list_item}>
              4.3.9. Обеспечивать сохранность личных данных от доступа третьих
              лиц.
            </p>
            <h4>4.4. Пользователю запрещается:</h4>
            <p className={styles.list_item}>
              4.4.1. Использовать любые устройства, программы, процедуры,
              алгоритмы и методы, автоматические устройства или эквивалентные
              ручные процессы для доступа, приобретения, копирования или
              отслеживания содержания Сайта.
            </p>
            <p className={styles.list_item}>
              4.4.2. Нарушать надлежащее функционирование Сайта.
            </p>
            <p className={styles.list_item}>
              4.4.3. Любым способом обходить навигационную структуру Сайта для
              получения или попытки получения любой информации, документов или
              материалов любыми средствами, которые специально не представлены
              сервисами данного Сайта.
            </p>
            <p className={styles.list_item}>
              4.4.4. Несанкционированный доступ к функциям Сайта, любым другим
              системам или сетям, относящимся к данному Сайту, а также к любым
              услугам, предлагаемым на Сайте.
            </p>
            <p className={styles.list_item}>
              4.4.5. Нарушать систему безопасности или аутентификации на Сайте
              или в любой сети, относящейся к Сайту.
            </p>
            <p className={styles.list_item}>
              4.4.6. Выполнять обратный поиск, отслеживать или пытаться
              отслеживать любую информацию о любом другом Пользователе Сайта.
            </p>
            <p className={styles.list_item}>
              4.4.7. Использовать Сайт и его Содержание в любых целях,
              запрещенных законодательством Российской Федерации, а также
              подстрекать к любой незаконной деятельности или другой
              деятельности, нарушающей права Сайта или других лиц.
            </p>
          </section>

          <section className={styles.section}>
            <h3>5. УСЛУГИ</h3>
            <p>
              5.1. При покупке любых услуг на сайте возврат не осуществляется,
              за исключением случаев, когда это прямо указано в условиях
              приобретения конкретной услуги.
            </p>
            <p>
              5.2. Администрация сайта не дает гарантий относительно достижения
              какого-либо эффекта в результате использования услуг продвижения
              Сервера на Сайте, включая, но не ограничиваясь:
            </p>
            <p className={styles.subsection_list}>
              Сохранением расположения или позиции Сервера в Мониторинге;
            </p>
            <p className={styles.subsection_list}>
              Увеличением количества переходов и/или подключений к Серверу;
            </p>
            <p className={styles.subsection_list}>
              Иными количественными или качественными показателями.
            </p>
            <p>
              5.3. Пользователь соглашается, что приобретая любые услуги на
              Сайте, он в полной мере оценил и принимает на себя все риски,
              связанные с любыми несоответствиями между фактическими
              результатами от использования услуг, предоставляемых на Сайте и
              ожиданиями Пользователя.
            </p>
            <p>
              5.4. Осуществляя покупку любых услуг, направленных на изменение
              расположения Сервера в Мониторинге и/или по персонализации Сервера
              в Мониторинге, Пользователь подтверждает, что приобретение
              Пользователем данных товаров и/или услуг на Сайте осуществляется в
              предпринимательских целях Пользователя (в том числе - для развития
              потенциально коммерциализируемого Сервера).
            </p>
            <p>
              5.5. Подробная информация и условия предоставления платных услуг
              на Сайте расположены по адресу:{" "}
              <a
                href="https://gamestate-monitor/offer"
                target="_blank"
                rel="noopener noreferrer"
              >
                https://gamestate-monitor/offer
              </a>
              .
            </p>
          </section>

          <section className={styles.section}>
            <h3>6. ИСПОЛЬЗОВАНИЕ САЙТА</h3>
            <p>
              6.1. Сайт и Содержание, входящее в состав Сайта, принадлежит и
              управляется Администрацией сайта.
            </p>
            <p>
              6.2. Содержание Сайта защищено авторским правом, законодательством
              о товарных знаках, а также другими правами, связанными с
              интеллектуальной собственностью, и законодательством о
              недобросовестной конкуренции.
            </p>
            <p>
              6.3. Настоящее Соглашение распространяет свое действия на все
              дополнительные положения и условия по оказанию Услуг,
              предоставляемых на Сайте.
            </p>
            <p>
              6.4. Информация, размещаемая на Сайте, не должна истолковываться
              как изменение настоящего Соглашения.
            </p>
            <p>
              6.5. Администрация сайта оставляет за собой право вносить
              изменения в перечень Услуг, предлагаемых на Сайте, а также их цен
              без предварительного уведомления Пользователя.
            </p>
          </section>

          <section className={styles.section}>
            <h3>7. ОТВЕТСТВЕННОСТЬ</h3>
            <p>
              7.1. Любые убытки, которые Пользователь может понести в случае
              умышленного или неосторожного нарушения любого положения
              настоящего Соглашения, а также вследствие несанкционированного
              доступа к коммуникациям другого Пользователя, Администрацией сайта
              не возмещаются.
            </p>
            <p>7.2. Администрация сайта не несет ответственности за:</p>
            <p className={styles.list_item}>
              7.2.1. Задержки или сбои в процессе совершения операций, возникшие
              вследствие непреодолимой силы, а также любых неполадок в
              телекоммуникационных, компьютерных, электрических и других смежных
              системах.
            </p>
            <p className={styles.list_item}>
              7.2.2. Действия систем переводов, банков, платежных систем и
              возможные задержки, связанные с их работой.
            </p>
            <p className={styles.list_item}>
              7.2.3. Надлежащее функционирование Сайта, если Пользователь не
              обладает необходимыми техническими средствами для его
              использования, а также не несет обязательств по обеспечению
              пользователей такими средствами;
            </p>
            <p className={styles.list_item}>
              7.2.4. любые действия Пользователей и третьих лиц, включая, но не
              ограничиваясь, их договоренностями, коммуникациями, соглашениями
              или сделками между собой, заключенными за пределами Сайта и его
              функциональности;
            </p>
            <p>
              7.3. Ответственность Администрации по настоящему Соглашению
              ограничена в рублях в размере, оплаченном Пользователем за
              выбранную услугу на Сайте.
            </p>
          </section>

          <section className={styles.section}>
            <h3>8. ОГРАНИЧЕНИЕ ОТВЕТСТВЕННОСТИ</h3>
            <p>
              Сайт предоставляется по принципу «как есть», то есть без гарантий
              качества и пригодности Сайта для каких-либо явных или
              подразумеваемых целей.
            </p>
            <p>
              Сайт не гарантирует, что будет работать беспрерывно и безошибочно.
              Администрация сайта вправе без объяснения причин отказать в
              доступе к Сайту всем Пользователям или любому из них на время или
              навсегда, удалить любую информацию или любой контент, данные и
              информацию, размещенные Пользователем на страницах Сайта.
            </p>
            <p>
              Администрация сайта оставляет за собой право в любое время
              приостановить предоставление услуг Пользователям без объяснения
              причин.
            </p>
            <p>
              Сайт не гарантирует и не несет ответственность за точность,
              актуальность, безвредность и достоверность информации, данных,
              размещенных на сторонних интернет ресурсах.
            </p>
            <p>
              При переходе по указанным ссылкам Пользователь осознает, что
              действует исключительно на свой страх и риск.
            </p>
            <p>
              Сайт не гарантирует сохранность контента, размещенного
              Пользователями на страницах Сайта, поэтому в случае если
              Пользователь заинтересован в сохранении какого-либо контента,
              размещенного в рамках Сайта, Пользователь должен воспользоваться
              иными способами сохранения необходимой информации.
            </p>
            <p>
              Пользователь подтверждает, что он использует Сайт на свой страх и
              риск.
            </p>
            <p>
              Сайт не гарантирует, что любая информация, загруженные данные
              Пользователями в рамках Сайта, будут отвечать критериям
              достоверности, точности и актуальности.
            </p>
            <p>
              Сайт не гарантирует, что размещаемая другими Пользователями
              информация не может причинить Пользователю моральный вред, вред
              здоровью либо убытки.
            </p>
          </section>

          <section className={styles.section}>
            <h3>9. НАРУШЕНИЕ УСЛОВИЙ ПОЛЬЗОВАТЕЛЬСКОГО СОГЛАШЕНИЯ</h3>
            <p>
              9.1. Администрация сайта может раскрыть информацию о Пользователе,
              если это требуется или разрешено действующим законодательством
              Российской Федерации.
            </p>
            <p>
              9.2. Администрация сайта вправе без предварительного уведомления
              Пользователя прекратить или заблокировать доступ к Сайту, если
              Пользователь нарушил настоящее Соглашение или условия пользования
              Сайтом, указанные в других документах, а также в случае
              прекращения функционирования Сайта или при возникновении
              технических проблем.
            </p>
            <p>
              9.3. Администрация сайта не несет ответственности перед
              Пользователем или третьими лицами за прекращение доступа к Сайту в
              случае нарушения Пользователем любого положения настоящего
              Соглашения или других документов, содержащих условия пользования
              Сайтом.
            </p>
          </section>

          <section className={styles.section}>
            <h3>10. РАЗРЕШЕНИЕ СПОРОВ</h3>
            <p>
              10.1. В случае возникновения любых разногласий или споров между
              Сторонами настоящего Соглашения, обязательным условием до
              обращения в суд является предъявление претензии (письменного
              предложения о добровольном урегулировании спора).
            </p>
            <p>
              10.2. Получатель претензии в течение 30 календарных дней со дня ее
              получения письменно уведомляет заявителя претензии о результатах
              рассмотрения претензии.
            </p>
            <p>
              10.3. При невозможности разрешить спор в добровольном порядке
              любая из сторон вправе обратиться в суд за защитой своих прав,
              предоставленных действующим законодательством Российской
              Федерации.
            </p>
            <p>
              Примечание: Сроки предъявления исковых требований определяются в
              соответствии с законодательством Российской Федерации.
            </p>
          </section>

          <section className={styles.section}>
            <h3>11. ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ</h3>
            <p>
              11.1. Любые изменения или дополнения к настоящему
              Пользовательскому соглашению могут быть произведены только
              Администрацией сайта.
            </p>
            <p>
              11.2. Администрация сайта не принимает встречные предложения от
              Пользователя относительно изменений настоящего Пользовательского
              соглашения.
            </p>
            <p>
              11.3. Отзывы Пользователя, размещенные на Сайте, не являются
              конфиденциальной информацией и могут быть использованы
              Администрацией сайта без ограничений.
            </p>
            <p>
              11.4. В случае если любое из положений/условий настоящего
              Пользовательского соглашения будет признано недействительным, то
              это не повлечет за собой недействительность других его
              условий/положений и настоящего Пользовательского соглашения и ее
              исполнение в целом, как если бы такое условие никогда не было
              частью настоящего Пользовательского соглашения.
            </p>
          </section>

          <section className={styles.section}>
            <h3>12. ИЗМЕНЕНИЕ ПРАВИЛ</h3>
            <p>
              12.1. Правила могут быть изменены в любое время без
              предварительного уведомления.
            </p>
            <p>
              12.2. Изменения вступают в силу с момента публикации на данной
              странице.
            </p>
          </section>

          <section className={styles.section}>
            <h3>РЕКВИЗИТЫ</h3>
            <p>Физическое лицо ________</p>
            <p>E-mail: _________</p>
            <p>Дата публикации: __ декабря 2025 г.</p>
          </section>
        </div>
      </div>
    </div>
  );
}
